tap "netbirdio/tap", trusted: true

brew "chezmoi"
brew "bat"
brew "bat-extras"
brew "ripgrep"
brew "eza"
brew "git"
brew "gh"
brew "midnight-commander"
brew "mole"
brew "neovim"
brew "zsh"
brew "starship"
brew "shfmt"

cask "alacritty"
cask "google-chrome"
cask "visual-studio-code"
cask "orbstack"
cask "vlc"
cask "fork"
cask "bruno"
cask "bitwarden"
cask "netbirdio/tap/netbird-ui"
cask "obsidian"
cask "telegram"
cask "chatgpt"
cask "font-JetBrains-Mono-nerd-font"
cask "steam"
cask "minecraft"

vscode "esbenp.prettier-vscode"
vscode "foxundermoon.shell-format"
vscode "tamasfe.even-better-toml"
vscode "irongeek.vscode-env"
vscode "redhat.vscode-yaml"
vscode "barnim.markdown-code-copy-button"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-azuretools.vscode-containers"
vscode "docker.docker"