tap "netbirdio/tap", trusted: true

brew "chezmoi"
brew "bat"
brew "eza"
brew "git"
brew "gh"
brew "midnight-commander"
brew "mole"
brew "neovim"
brew "zsh"
brew "starship"

cask "alacritty"
cask "google-chrome"
cask "visual-studio-code"
cask "orbstack"
cask "vlc"
cask "fork"
cask "bruno"
cask "bitwarden"
cask "netbirdio/tap/netbird-ui"
cask "obsidian"
cask "telegram"
cask "chatgpt"
cask "font-JetBrains-Mono-nerd-font"
