tap "netbirdio/tap", trusted: true

# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Bash scripts that integrate bat with various command-line tools
brew "bat-extras"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Modern, maintained replacement for ls
brew "eza"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Port of http_parser to llparse
brew "llhttp"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit"
# Terminal-based visual file manager
brew "midnight-commander"
# Deep clean and optimize your Mac
brew "mole"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Netbird CLI
brew "netbirdio/tap/netbird", trusted: true
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Autoformat shell script source code
brew "shfmt"
# Cross-shell prompt for astronauts
brew "starship"
# UNIX shell (command interpreter)
brew "zsh"

# Cross platform SQL editor and database management app
cask "beekeeper-studio"
# Desktop password and login vault
cask "bitwarden"
# Open source IDE for exploring and testing APIs
cask "bruno"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Voice and text chat software
cask "discord"
# JetBrainsMono Nerd Font families (JetBrains Mono)
cask "font-jetbrains-mono-nerd-font"
# GIT client
cask "fork"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Web browser
cask "google-chrome"
# Mouse utility to add gesture functions and smooth scrolling to 3rd party mice
cask "mac-mouse-fix"
# Sandbox construction video game
cask "minecraft"
# Netbird GUI
cask "netbirdio/tap/netbird-ui", trusted: true
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Replacement for Docker Desktop
cask "orbstack"
# Video game digital distribution service
cask "rustdesk"
# Open source virtual/remote desktop application
cask "steam"
# Messaging app with a focus on speed and security
cask "telegram"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"

vscode "barnim.markdown-code-copy-button"
vscode "docker.docker"
vscode "esbenp.prettier-vscode"
vscode "irongeek.vscode-env"
vscode "lumirelle.shell-format-rev"
vscode "ms-azuretools.vscode-containers"
vscode "ms-vscode-remote.remote-containers"
vscode "redhat.vscode-yaml"
vscode "tamasfe.even-better-toml"
